results/factorial-final/security-overhead-final-mtls-broker5/security-overhead-final-factorial-mtls-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod6-compnone-trial3/producer-perf-3.log
producer_index=3
producer_count=6
producer_records=16667
producer_throughput=167
1 records sent, 0.1 records/sec (0.01 MB/sec), 9694.0 ms avg latency, 9694.0 ms max latency.
190 records sent, 37.5 records/sec (3.67 MB/sec), 4335.7 ms avg latency, 5928.0 ms max latency.
324 records sent, 63.7 records/sec (6.22 MB/sec), 6066.1 ms avg latency, 7409.0 ms max latency.
584 records sent, 116.2 records/sec (11.35 MB/sec), 3694.9 ms avg latency, 5424.0 ms max latency.
906 records sent, 181.0 records/sec (17.68 MB/sec), 663.1 ms avg latency, 1810.0 ms max latency.
673 records sent, 134.4 records/sec (13.12 MB/sec), 22.3 ms avg latency, 106.0 ms max latency.
807 records sent, 160.9 records/sec (15.71 MB/sec), 23.5 ms avg latency, 93.0 ms max latency.
838 records sent, 167.2 records/sec (16.33 MB/sec), 21.2 ms avg latency, 95.0 ms max latency.
889 records sent, 177.6 records/sec (17.35 MB/sec), 57.7 ms avg latency, 415.0 ms max latency.
873 records sent, 174.5 records/sec (17.04 MB/sec), 21.4 ms avg latency, 146.0 ms max latency.
832 records sent, 166.3 records/sec (16.24 MB/sec), 22.8 ms avg latency, 149.0 ms max latency.
897 records sent, 178.5 records/sec (17.44 MB/sec), 25.8 ms avg latency, 142.0 ms max latency.
862 records sent, 172.4 records/sec (16.84 MB/sec), 16.2 ms avg latency, 74.0 ms max latency.
847 records sent, 168.8 records/sec (16.48 MB/sec), 16.6 ms avg latency, 106.0 ms max latency.
892 records sent, 178.3 records/sec (17.41 MB/sec), 22.7 ms avg latency, 168.0 ms max latency.
867 records sent, 173.3 records/sec (16.92 MB/sec), 46.5 ms avg latency, 374.0 ms max latency.
883 records sent, 176.3 records/sec (17.22 MB/sec), 18.1 ms avg latency, 77.0 ms max latency.
904 records sent, 180.8 records/sec (17.65 MB/sec), 15.9 ms avg latency, 78.0 ms max latency.
983 records sent, 196.3 records/sec (19.17 MB/sec), 15.4 ms avg latency, 65.0 ms max latency.
916 records sent, 182.8 records/sec (17.85 MB/sec), 13.1 ms avg latency, 68.0 ms max latency.
990 records sent, 198.0 records/sec (19.34 MB/sec), 16.5 ms avg latency, 106.0 ms max latency.
16667 records sent, 146.955870 records/sec (14.35 MB/sec), 353.54 ms avg latency, 9694.00 ms max latency, 16 ms 50th, 3446 ms 95th, 6061 ms 99th, 6930 ms 99.9th.